# Preparando ambiente

In [65]:
import pandas as pd

In [66]:
print(pd.__version__)

1.1.3

In [68]:
# Abrir arquivo .csv
dataframe = pd.read_csv("data/alunos.csv", sep=";", encoding="ANSI")

# Iniciando análises

In [69]:
# Imprimir apenas cabeçalho
dataframe.head()

      Nome  Idade Endereço           Cidade  Nota Aprovação Sexo
0    Renan     18   Rua 10         Maranhao     0       Não    M
1     João     19    Rua A   Rio de Janeiro    10       Sim    M
2   Maria      17    Rua 8       São Paulo      8      Sim     F
3  Junior      17    Rua 8       São Paulo      4       Não    M
4   Carlos     18   Rua 10  Belo Horizonte      9      Sim     M

In [70]:
# Imprimir todo dataframe
dataframe

      Nome  Idade Endereço           Cidade  Nota Aprovação Sexo
0    Renan     18   Rua 10         Maranhao     0       Não    M
1     João     19    Rua A   Rio de Janeiro    10       Sim    M
2   Maria      17    Rua 8       São Paulo      8      Sim     F
3  Junior      17    Rua 8       São Paulo      4       Não    M
4   Carlos     18   Rua 10  Belo Horizonte      9      Sim     M
5  Robento     22   Rua 19  Santa Catarina      6      Sim     M
6   Carla      18   Rua 10         Maranhao    10      Sim     F
7   Renata     23   Rua 20         Curitiba     8      Sim     F

In [72]:
df = pd.read_csv("data/alunos.csv", sep=";", encoding="ANSI", usecols=["Nome", "Idade", "Aprovação", "Nota"])

In [73]:
df.head()

      Nome  Idade  Nota Aprovação
0    Renan     18     0       Não
1     João     19    10       Sim
2   Maria      17     8      Sim
3  Junior      17     4       Não
4   Carlos     18     9      Sim

In [74]:
df = pd.read_csv("data/survey_results_public.csv")

In [75]:
df.head()

,Respondent,MainBranch,Hobbyist,Age,Age1stCode,CompFreq,CompTotal,ConvertedComp,Country,CurrencyDesc,...,SurveyEase,SurveyLength,Trans,UndergradMajor,WebframeDesireNextYear,WebframeWorkedWith,WelcomeChange,WorkWeekHrs,YearsCode,YearsCodePro
0,1,I am a developer by profession,Yes,NaN,13,Monthly,NaN,NaN,Germany,European Euro,...,Neither easy nor difficult,Appropriate in length,No,"Computer science, computer engineering, or sof...",ASP.NET Core,ASP.NET;ASP.NET Core,Just as welcome now as I felt last year,50.0,36,27
1,2,I am a developer by profession,No,NaN,19,NaN,NaN,NaN,United Kingdom,Pound sterling,...,NaN,NaN,NaN,"Computer science, computer engineering, or sof...",NaN,NaN,Somewhat more welcome now than last year,NaN,7,4
2,3,I code primarily as a hobby,Yes,NaN,15,NaN,NaN,NaN,Russian Federation,NaN,...,Neither easy nor difficult,Appropriate in length,NaN,NaN,NaN,NaN,Somewhat more welcome now than last year,NaN,4,NaN
3,4,I am a developer by profession,Yes,25.0,18,NaN,NaN,NaN,Albania,Albanian lek,...,NaN,NaN,No,"Computer science, computer engineering, or sof...",NaN,NaN,Somewhat less welcome now than last year,40.0,7,4
4,5,"I used to be a developer by profession, but no...",Yes,31.0,16,NaN,NaN,NaN,United States,NaN,...,Easy,Too short,No,"Computer science, computer engineering, or sof...",Django;Ruby on Rails,Ruby on Rails,Just as welcome now as I felt last year,NaN,15,8

In [76]:
# Linhas e colunas
df.shape

(64461, 61)

In [77]:
# Tipos de dados do dataframe
df.dtypes

Respondent              int64
MainBranch             object
Hobbyist               object
Age                   float64
Age1stCode             object
                       ...
WebframeWorkedWith     object
WelcomeChange          object
WorkWeekHrs           float64
YearsCode              object
YearsCodePro           object
Length: 61, dtype: object

In [78]:
# Informacoes sobre dataframe
df.info

&lt;bound method DataFrame.info of        Respondent                                         MainBranch Hobbyist  \
0               1                     I am a developer by profession      Yes
1               2                     I am a developer by profession       No
2               3                        I code primarily as a hobby      Yes
3               4                     I am a developer by profession      Yes
4               5  I used to be a developer by profession, but no...      Yes
...           ...                                                ...      ...
64456       64858                                                NaN      Yes
64457       64867                                                NaN      Yes
64458       64898                                                NaN      Yes
64459       64925                                                NaN      Yes
64460       65112                                                NaN      Yes

        Age Age1stCode CompFreq  CompTotal  ConvertedComp             Country  \
0       NaN         13  Monthly        NaN            NaN             Germany
1       NaN         19      NaN        NaN            NaN      United Kingdom
2       NaN         15      NaN        NaN            NaN  Russian Federation
3      25.0         18      NaN        NaN            NaN             Albania
4      31.0         16      NaN        NaN            NaN       United States
...     ...        ...      ...        ...            ...                 ...
64456   NaN         16      NaN        NaN            NaN       United States
64457   NaN        NaN      NaN        NaN            NaN             Morocco
64458   NaN        NaN      NaN        NaN            NaN            Viet Nam
64459   NaN        NaN      NaN        NaN            NaN              Poland
64460   NaN        NaN      NaN        NaN            NaN               Spain

         CurrencyDesc  ...                  SurveyEase           SurveyLength  \
0       European Euro  ...  Neither easy nor difficult  Appropriate in length
1      Pound sterling  ...                         NaN                    NaN
2                 NaN  ...  Neither easy nor difficult  Appropriate in length
3        Albanian lek  ...                         NaN                    NaN
4                 NaN  ...                        Easy              Too short
...               ...  ...                         ...                    ...
64456             NaN  ...                         NaN                    NaN
64457             NaN  ...                         NaN                    NaN
64458             NaN  ...                         NaN                    NaN
64459             NaN  ...                         NaN                    NaN
64460             NaN  ...                         NaN                    NaN

      Trans                                     UndergradMajor  \
0        No  Computer science, computer engineering, or sof...
1       NaN  Computer science, computer engineering, or sof...
2       NaN                                                NaN
3        No  Computer science, computer engineering, or sof...
4        No  Computer science, computer engineering, or sof...
...     ...                                                ...
64456   NaN  Computer science, computer engineering, or sof...
64457   NaN                                                NaN
64458   NaN                                                NaN
64459   NaN                                                NaN
64460   NaN  Computer science, computer engineering, or sof...

            WebframeDesireNextYear                      WebframeWorkedWith  \
0                     ASP.NET Core                    ASP.NET;ASP.NET Core
1                              NaN                                     NaN
2                              NaN                                     NaN
3                              NaN                                     NaN
4             Django;Ruby on Rails                           Ruby on Rails
...                            ...                                     ...
64456                          NaN                                     NaN
64457                          NaN                                     NaN
64458                          NaN                                     NaN
64459  Angular;Angular.js;React.js                                     NaN
64460          ASP.NET Core;jQuery  Angular;Angular.js;ASP.NET Core;jQuery

                                  WelcomeChange WorkWeekHrs YearsCode  \
0       Just as welcome now as I felt last year        50.0        36
1      Somewhat more welcome now than last year         NaN         7
2      Somewhat more welcome now than last year         NaN         4
3      Somewhat less welcome now than last year        40.0         7
4       Just as welcome now as I felt last year         NaN        15
...                                         ...         ...       ...
64456                                       NaN         NaN        10
64457                                       NaN         NaN       NaN
64458                                       NaN         NaN       NaN
64459                                       NaN         NaN       NaN
64460                                       NaN         NaN       NaN

           YearsCodePro
0                    27
1                     4
2                   NaN
3                     4
4                     8
...                 ...
64456  Less than 1 year
64457               NaN
64458               NaN
64459               NaN
64460               NaN

[64461 rows x 61 columns]&gt;

In [80]:
aluno = pd.read_csv("data/alunos.csv", sep=";", encoding="ANSI")

In [81]:
aluno

      Nome  Idade Endereço           Cidade  Nota Aprovação Sexo
0    Renan     18   Rua 10         Maranhao     0       Não    M
1     João     19    Rua A   Rio de Janeiro    10       Sim    M
2   Maria      17    Rua 8       São Paulo      8      Sim     F
3  Junior      17    Rua 8       São Paulo      4       Não    M
4   Carlos     18   Rua 10  Belo Horizonte      9      Sim     M
5  Robento     22   Rua 19  Santa Catarina      6      Sim     M
6   Carla      18   Rua 10         Maranhao    10      Sim     F
7   Renata     23   Rua 20         Curitiba     8      Sim     F

In [82]:
# Exportando para excel
aluno.to_excel("data/alunos-excel.xlsx")

In [83]:
# Ler do excel que acabou de ser criado
dados = pd.read_excel("data/alunos-excel.xlsx")

In [84]:
dados

   Unnamed: 0     Nome  Idade Endereço           Cidade  Nota Aprovação Sexo
0           0    Renan     18   Rua 10         Maranhao     0       Não    M
1           1     João     19    Rua A   Rio de Janeiro    10       Sim    M
2           2   Maria      17    Rua 8       São Paulo      8      Sim     F
3           3  Junior      17    Rua 8       São Paulo      4       Não    M
4           4   Carlos     18   Rua 10  Belo Horizonte      9      Sim     M
5           5  Robento     22   Rua 19  Santa Catarina      6      Sim     M
6           6   Carla      18   Rua 10         Maranhao    10      Sim     F
7           7   Renata     23   Rua 20         Curitiba     8      Sim     F

In [85]:
dados["Nome"]

0      Renan
1       João
2     Maria
3    Junior
4     Carlos
5    Robento
6     Carla
7     Renata
Name: Nome, dtype: object

In [86]:
dados[["Nome", "Nota", "Sexo"]]

      Nome  Nota Sexo
0    Renan     0    M
1     João    10    M
2   Maria      8    F
3  Junior      4    M
4   Carlos     9    M
5  Robento     6    M
6   Carla     10    F
7   Renata     8    F

In [87]:
# Localização por índices - Linha
dados.loc[[0]]

   Unnamed: 0   Nome  Idade Endereço    Cidade  Nota Aprovação Sexo
0           0  Renan     18   Rua 10  Maranhao     0       Não    M

In [88]:
# Apenas linha 7
dados.loc[[7]]

   Unnamed: 0    Nome  Idade Endereço    Cidade  Nota Aprovação Sexo
7           7  Renata     23   Rua 20  Curitiba     8      Sim     F

In [89]:
# Intervalo de linhas
dados.loc[0:3]

   Unnamed: 0     Nome  Idade Endereço          Cidade  Nota Aprovação Sexo
0           0    Renan     18   Rua 10        Maranhao     0       Não    M
1           1     João     19    Rua A  Rio de Janeiro    10       Sim    M
2           2   Maria      17    Rua 8      São Paulo      8      Sim     F
3           3  Junior      17    Rua 8      São Paulo      4       Não    M

In [90]:
# Intervalo de linhas com passo de 2
dados.loc[0:5:2]

   Unnamed: 0    Nome  Idade Endereço           Cidade  Nota Aprovação Sexo
0           0   Renan     18   Rua 10         Maranhao     0       Não    M
2           2  Maria      17    Rua 8       São Paulo      8      Sim     F
4           4  Carlos     18   Rua 10  Belo Horizonte      9      Sim     M

In [91]:
# Criando novos dados
NewData = {
    "Nome":["Tiago", "João", "Maria"],
    "Idade": ["18", "15", "23"]
}

In [92]:
NewData

{&#39;Nome&#39;: [&#39;Tiago&#39;, &#39;João&#39;, &#39;Maria&#39;], &#39;Idade&#39;: [&#39;18&#39;, &#39;15&#39;, &#39;23&#39;]}

In [93]:
# Criando novo dataframe
nomes = pd.DataFrame(NewData)

In [94]:
nomes

    Nome Idade
0  Tiago    18
1   João    15
2  Maria    23

In [95]:
nomes.to_excel("data/nome.xlsx")

In [96]:
# Alteração temporária
dados.rename(columns={"Aprovação":"Aprovado"})

   Unnamed: 0     Nome  Idade Endereço           Cidade  Nota Aprovado Sexo
0           0    Renan     18   Rua 10         Maranhao     0      Não    M
1           1     João     19    Rua A   Rio de Janeiro    10      Sim    M
2           2   Maria      17    Rua 8       São Paulo      8     Sim     F
3           3  Junior      17    Rua 8       São Paulo      4      Não    M
4           4   Carlos     18   Rua 10  Belo Horizonte      9     Sim     M
5           5  Robento     22   Rua 19  Santa Catarina      6     Sim     M
6           6   Carla      18   Rua 10         Maranhao    10     Sim     F
7           7   Renata     23   Rua 20         Curitiba     8     Sim     F

In [97]:
dados

   Unnamed: 0     Nome  Idade Endereço           Cidade  Nota Aprovação Sexo
0           0    Renan     18   Rua 10         Maranhao     0       Não    M
1           1     João     19    Rua A   Rio de Janeiro    10       Sim    M
2           2   Maria      17    Rua 8       São Paulo      8      Sim     F
3           3  Junior      17    Rua 8       São Paulo      4       Não    M
4           4   Carlos     18   Rua 10  Belo Horizonte      9      Sim     M
5           5  Robento     22   Rua 19  Santa Catarina      6      Sim     M
6           6   Carla      18   Rua 10         Maranhao    10      Sim     F
7           7   Renata     23   Rua 20         Curitiba     8      Sim     F

In [98]:
# Alteração permanente
dados.rename(columns={"Aprovação":"Aprovado"}, inplace=True)

In [99]:
dados

   Unnamed: 0     Nome  Idade Endereço           Cidade  Nota Aprovado Sexo
0           0    Renan     18   Rua 10         Maranhao     0      Não    M
1           1     João     19    Rua A   Rio de Janeiro    10      Sim    M
2           2   Maria      17    Rua 8       São Paulo      8     Sim     F
3           3  Junior      17    Rua 8       São Paulo      4      Não    M
4           4   Carlos     18   Rua 10  Belo Horizonte      9     Sim     M
5           5  Robento     22   Rua 19  Santa Catarina      6     Sim     M
6           6   Carla      18   Rua 10         Maranhao    10     Sim     F
7           7   Renata     23   Rua 20         Curitiba     8     Sim     F

In [100]:
# Deletar toda a coluna "Name" -> axis=1
dados.drop("Nome", axis=1)

   Unnamed: 0  Idade Endereço           Cidade  Nota Aprovado Sexo
0           0     18   Rua 10         Maranhao     0      Não    M
1           1     19    Rua A   Rio de Janeiro    10      Sim    M
2           2     17    Rua 8       São Paulo      8     Sim     F
3           3     17    Rua 8       São Paulo      4      Não    M
4           4     18   Rua 10  Belo Horizonte      9     Sim     M
5           5     22   Rua 19  Santa Catarina      6     Sim     M
6           6     18   Rua 10         Maranhao    10     Sim     F
7           7     23   Rua 20         Curitiba     8     Sim     F

In [101]:
dados.drop(1)

   Unnamed: 0     Nome  Idade Endereço           Cidade  Nota Aprovado Sexo
0           0    Renan     18   Rua 10         Maranhao     0      Não    M
2           2   Maria      17    Rua 8       São Paulo      8     Sim     F
3           3  Junior      17    Rua 8       São Paulo      4      Não    M
4           4   Carlos     18   Rua 10  Belo Horizonte      9     Sim     M
5           5  Robento     22   Rua 19  Santa Catarina      6     Sim     M
6           6   Carla      18   Rua 10         Maranhao    10     Sim     F
7           7   Renata     23   Rua 20         Curitiba     8     Sim     F

In [102]:
dados.drop([2,4,6])

   Unnamed: 0     Nome  Idade Endereço           Cidade  Nota Aprovado Sexo
0           0    Renan     18   Rua 10         Maranhao     0      Não    M
1           1     João     19    Rua A   Rio de Janeiro    10      Sim    M
3           3  Junior      17    Rua 8       São Paulo      4      Não    M
5           5  Robento     22   Rua 19  Santa Catarina      6     Sim     M
7           7   Renata     23   Rua 20         Curitiba     8     Sim     F

In [103]:
dados.drop(0, inplace=True)

In [104]:
dados

   Unnamed: 0     Nome  Idade Endereço           Cidade  Nota Aprovado Sexo
1           1     João     19    Rua A   Rio de Janeiro    10      Sim    M
2           2   Maria      17    Rua 8       São Paulo      8     Sim     F
3           3  Junior      17    Rua 8       São Paulo      4      Não    M
4           4   Carlos     18   Rua 10  Belo Horizonte      9     Sim     M
5           5  Robento     22   Rua 19  Santa Catarina      6     Sim     M
6           6   Carla      18   Rua 10         Maranhao    10     Sim     F
7           7   Renata     23   Rua 20         Curitiba     8     Sim     F